ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкаПробегов/УТЗ_ПЛ_КорректировкаПробегов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_КорректировкаПробегов</name>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ПробегАвтотранспорта</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокАвтотранспортаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАвтотранспорта</name>
    <attributes>
      <name>Автотранспорт</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.УТЗ_ПЛ_ВидыДвиженийКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегТекущий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегСкорректированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыДвиженийКорректировок/УТЗ_ПЛ_ВидыДвиженийКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыДвиженийКорректировок</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкаПробегов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАвтотранспорта

&НаКлиенте
Процедура СписокАвтотранспортаАвтотранспортПриИзменении(Элемент)
	
	ТекДанн = Элементы.СписокАвтотранспорта.ТекущиеДанные;
	Пробег = 0;
	Если ЗначениеЗаполнено(ТекДанн.Автотранспорт) Тогда
		Пробег = ПробегАвтотранспорта(ТекДанн.Автотранспорт);	
	КонецЕсли;
	
	ТекДанн.ПробегТекущий = Пробег;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаВидДвиженияПриИзменении(Элемент)
	РассчитатьСкорректированныйПробег(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаКоличествоПриИзменении(Элемент)
	РассчитатьСкорректированныйПробег(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПробегАвтотранспорта(Автотранспорт)
	ДатаАктуальности = ДатаАктуальностиПолученияДанных();
	Возврат УТЗ_ПЛ_АвтотранспортВызовСервера.ПробегАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности);
КонецФункции

&НаКлиенте
Процедура РассчитатьСкорректированныйПробег(ТекСтрока)
	
	ПробегСкорректированный = ТекСтрока.ПробегТекущий;
	
	Если ТекСтрока.ВидДвижения = ВидДвиженияКорректировокПриход() Тогда
		ПробегСкорректированный = ТекСтрока.ПробегТекущий + ТекСтрока.Количество;
	ИначеЕсли ТекСтрока.ВидДвижения = ВидДвиженияКорректировокРасход() Тогда
		ПробегСкорректированный = ТекСтрока.ПробегТекущий - ТекСтрока.Количество;
	КонецЕсли;
	
	ТекСтрока.ПробегСкорректированный = ПробегСкорректированный;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокПриход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Приход;
КонецФункции

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокРасход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Расход;
КонецФункции

&НаКлиенте
Функция ДатаАктуальностиПолученияДанных()
	ДатаАктуальности = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	Возврат ДатаАктуальности;
КонецФункции

#КонецОбласти
